Config/DataProcessors/ИмпортКейса.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<DataProcessor>
		<Properties>
			<Name>ИмпортКейса</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>АдресКомплекта</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РазрешитьУдалениеОбъектов</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВыводитьСообщения</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РегистрироватьПримечания</Name>
					<Comment>Помимо ошибок и предупреждений выводить также и информацию в журнал регистрации</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</DataProcessor>
</MetaDataObject>

Config/InformationRegisters/УстановленныеКомплектыОтчетности.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>УстановленныеКомплектыОтчетности</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Наименование</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Описание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Поставщик</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Версия</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОписаниеИзмененийHTML</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НеИспользуется</Name>
					<Comment>Если Истина, то по умолчанию не будет установлен флаг в загрузке комплекта и не будет оповещать о новой версии</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ИдентификаторКомплекта</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Config/Catalogs/ПравилаЗаполнения.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>ПравилаЗаполнения</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
			<Owners>
				<xr:Item>Catalog.ВидыОтчетов</xr:Item>
			</Owners>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>НеИспользуется</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗаполнениеСНастройками</Name>
					<Comment>При заполнении отчета всегда выводится форма настроек заполнения</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ДополнительнаяОбработкаДанных</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>МетодОбработки</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>150</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Параметры</Name>
							<Type>
								<v8:Type>v8:ValueStorage</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВыполнятьПриЗаполнении</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ОтображатьВМенюЗаполнения</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПредставлениеПараметров</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>250</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НаименованиеВИнтерфейсе</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>150</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИзменяетсяВНастройкеЗаполнения</Name>
							<Comment>Если Истина, отображается в форме "Настройка заполнения" и "Заполнение по документу основанию"</Comment>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>БезПодтверждения</Name>
							<Comment>Если "ОтображатьВМенюЗаполнения" = Истина, то при нажатии на команду в отчете, если "БезПодтверждения" = Истина, не будет открываться окно настроек.</Comment>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТекстПодсказки</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>КартыДанных</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ТаблицаДанных</Name>
							<Type>
								<v8:Type>v8:ValueStorage</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Представление</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ОбщиеПараметры</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ИмяПараметра</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>25</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЗначениеПараметра</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
								<v8:Type>xs:string</v8:Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:TypeSet>cfg:AnyIBRef</v8:TypeSet>
								<v8:NumberQualifiers>
									<v8:Digits>18</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
								<v8:DateQualifiers>
									<v8:DateFractions>DateTime</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПользовательскаяДоступность</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВидАналитики</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.АналитикаОтчетов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПредставлениеПараметра</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ОписаниеПараметра</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЗадаетсяСпискомЗначений</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Config/DataProcessors/ИмпортКейса/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
///////////////////////////////////////////////////////////////////////////////////
// ПРОГРАММНЫЙ ИНТЕРФЕЙС

// Загрузка комплекта отчетности под управлением механизма длительных операций
//
Процедура ЗагрузитьКомплектОтчетности(Знач ПараметрыОперации, Знач АдресХранилища) Экспорт
	
	ПутьКФайлу = СохранитьВКаталогВременныхФайлов(ПараметрыОперации.ДанныеФайла);
	
	МодульЗагрузки = Обработки.ИмпортКейса.Создать();
	
	Если ПараметрыОперации.Свойство("ВключитьПрогрессор") и ПараметрыОперации.ВключитьПрогрессор = Истина Тогда
		
		Параметры               = МодульЗагрузки.СоздатьПараметрыПрогрессора();
		Параметры.ШагОбновления = 20;
		Параметры.АдресДанных   = АдресХранилища;
		
		МодульЗагрузки.УстановитьОбработчикУведомленийОСостоянии(МодульЗагрузки, Параметры);
		
	КонецЕсли;
	
	СтруктураДополнительныхДанных = Новый Структура;
	
	Если ПараметрыОперации.Свойство("ОписаниеКомплекта") Тогда
		СтруктураДополнительныхДанных.Вставить("ДопИнформация",ПараметрыОперации.ОписаниеКомплекта);	
	КонецЕсли;	
		
	МодульЗагрузки.АдресКомплекта = ПутьКФайлу;
	РезультатЗагрузки = МодульЗагрузки.Загрузить(СтруктураДополнительныхДанных);
	
	ПоместитьВоВременноеХранилище(РезультатЗагрузки, АдресХранилища); // Возврат результата из фонового задания
	
	Попытка
		УдалитьФайлы(ПутьКФайлу);
	Исключение
		// Специальная обработка не требуется
	КонецПопытки;
	
	Попытка
		Справочники.ПравилаЗаполнения.ОтключитьНеИспользуемыеПравила();
	Исключение
		//Если что-то не отключили, это не страшно
	КонецПопытки;
	
КонецПроцедуры

// Проверяет, что указанная версия схемы xml поддерживается и может быть загружена
//
Функция ВерсияСхемыПоддерживается(Знач ВерсияСхемы) Экспорт

	Если ВерсияСхемы = "0.3"
		 или ВерсияСхемы = "0.4"
		 или ВерсияСхемы = "0.5"
		 или ВерсияСхемы = "0.6" Тогда
		Возврат Истина;
	Иначе
		Возврат Ложь;
	КонецЕсли;

КонецФункции // ВерсияСхемыПоддерживается()

///////////////////////////////////////////////////////////////////////////////////
// СЛУЖЕБНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ

Функция СохранитьВКаталогВременныхФайлов(Знач ДанныеФайла)

	ВременныйФайл  = ПолучитьИмяВременногоФайла(".xml");
	
	Если ТипЗнч(ДанныеФайла) = Тип("ХранилищеЗначения") Тогда
		ДвоичныеДанные = ДанныеФайла.Получить();
	ИначеЕсли ТипЗнч(ДанныеФайла) = Тип("ДвоичныеДанные") Тогда
		ДвоичныеДанные = ДанныеФайла;
	Иначе
		ВызватьИсключение НСтр("ru = 'Некорректный тип параметра ""ДанныеФайла"".'");
	КонецЕсли;
	
	ДвоичныеДанные.Записать(ВременныйФайл);
	
	Возврат ВременныйФайл;

КонецФункции // СохранитьФайлНаДиск()

Функция ПолучитьДанныеНаСервере(АдресСтраницыПоддержки,КукиДляНужнойСтраницы,ДанныеАутентификации,СообщатьОбОшибкахПолученияДанных=Ложь,ТекстОшибки=Неопределено) Экспорт
	
	СтраницаПоддержкиКонфигурации = "";
	//Принцип работы
	//1 - обращаемся к нужной странице сайта - из ответа сохраняем куки данной сессии и выполняется переадресация на "https://login.1c.ru/login?service=https%3A%2F%2Freleases.1c.ru%2Fpublic%2Fsecurity_check" 
	//2 - открываем страницу "https://login.1c.ru/login?service=https%3A%2F%2Freleases.1c.ru%2Fpublic%2Fsecurity_check"
	//	берем из нее куки для авторизации, из текста страницы получаем значение параметра execution.
	//3 - открываем страницу https://login.1c.ru/login и передаем параметры:
	//		- username - логин пользователя на портале
	//      - password - пароль пользователя на портале
	//		- inviteCode - пустой параметр
	//		- execution - значение параметра execution с предыдущей страницы
	//		- _eventId=submit - значение submit
	//      - geolocation - пустой параметр
	//		- submit=%D0%92%D0%BE%D0%B9%D1%82%D0%B8 - значение "Войти"
	//		- rememberMe=on - значение on
	//В ответ в переадресации приходит ссылка вида https://releases.1c.ru/public/security_check?ticket=ST-1650346-SPjd4P7z7BGgfYgMXwxh-login-tomcat3-gpt-msk
	//4 - открываем ссылку из 3 и устанавливаем куки из 1 - в ответе ссылка уже на нужную нам страницу из 1
	//5 - теперь можем открывать любые страницы портала, нужно только в заголовках устанавливать куки из 1
	
	ПараметрыЗапроса = Новый Структура("ФорматОтвета",4);
	
	Если ЗначениеЗаполнено(КукиДляНужнойСтраницы) Тогда
		Заголовки = Новый Соответствие;
	    Заголовки.Вставить("Cookie", КукиДляНужнойСтраницы);
		
		ПараметрыЗапроса.Вставить("Заголовки",Заголовки);
	КонецЕсли;
		
	Результат = ЗагрузитьСодержимоеИзИнтернет(АдресСтраницыПоддержки,,,ПараметрыЗапроса);
	
	Если Результат.КодОшибки = "ConnectError" Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(Нстр("ru='Не удалось выполнить подключение к серверу.'"));
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(Результат.СообщениеОбОшибке);
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru = 'Подробности см. в журнале регистрации.'"));
	КонецЕсли;
	
	Если Результат.Содержимое = Неопределено Тогда
		Возврат "";
	КонецЕсли;
	
	Если Результат.Содержимое.КодСостояния = 302 Тогда
			
		Location = ПолучитьLocationИзОтвета(Результат.Содержимое);
		
		АдресАвторизации = "https://login.1c.ru/login?service=https%3A%2F%2Freleases.1c.ru%2Fpublic%2Fsecurity_check";//адрес по умолчанию, именно он возвращается в Location
		
		Если ТребуетсяАвторизация(Location) Тогда
			КукиДляНужнойСтраницы = ПолучитьКукиИзОтвета(Результат.Содержимое);
			
			АдресАвторизации = Location;
			
			Отказ = Ложь;
			Результат = ПройтиАвторизацию(АдресАвторизации,Отказ,КукиДляНужнойСтраницы,ДанныеАутентификации);
			
			Если Отказ = Истина Тогда
				КукиДляНужнойСтраницы = "";
			КонецЕсли;
						
		Иначе
			//обычная переадресация, если вдруг адрес не верный
			
			Результат = ЗагрузитьСодержимоеИзИнтернет(Location,,,ПараметрыЗапроса,Истина);
			
		КонецЕсли;
				
		
	КонецЕсли;
	
	Если Результат.Содержимое = Неопределено 
		ИЛИ Результат.Содержимое.КодСостояния < 200 
		ИЛИ Результат.Содержимое.КодСостояния >= 300 Тогда
		
		Если СообщатьОбОшибкахПолученияДанных Тогда
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(Результат.СообщениеОбОшибке);
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(Результат.ИнформацияОбОшибке);
		Иначе
			//пишем в журнал регистрации
			МассивОшибок = Новый Массив;
			МассивОшибок.Добавить(Результат.СообщениеОбОшибке);
			МассивОшибок.Добавить(Результат.ИнформацияОбОшибке);
			ТекстОшибки = СтрСоединить(МассивОшибок,Символы.ПС);
		КонецЕсли;
		
	Иначе 
		//все ок
		
		СтраницаПоддержкиКонфигурации = СокрЛП(Результат.Содержимое.ПолучитьТелоКакСтроку());
		
	КонецЕсли;
	
	Возврат СтраницаПоддержкиКонфигурации;
КонецФункции

Процедура ЗаполнитьТаблицуФайловПоДаннымСтраницыПоддержки(СтраницаСайта,ТаблицаФайлов) Экспорт
	
	ПозицияДопМатериалов = СтрНайти(СтраницаСайта,"additionalFilesTable",НаправлениеПоиска.СКонца);
	Если ПозицияДопМатериалов = 0 Тогда
		Возврат;
	КонецЕсли;
	
	СтрокаДопМатериалов = Сред(СтраницаСайта,ПозицияДопМатериалов);
	
	СоответствиеИменИдентификаторам = БюджетнаяОтчетностьСервер.СоответствиеИменКомплектовИдентификаторам();
	
	ПозицияСсылкиН = 1;
	НомерВхождения = 1;
	Пока ПозицияСсылкиН<>0 Цикл
		
		ПозицияСсылкиН = СтрНайти(СтрокаДопМатериалов,"href=""",,,НомерВхождения);
		Если ПозицияСсылкиН = 0 Тогда
			Прервать;
		КонецЕсли;
		
		ПозицияСсылкиК = СтрНайти(СтрокаДопМатериалов,"""",,ПозицияСсылкиН+6);
		ТекстСсылки = Сред(СтрокаДопМатериалов,ПозицияСсылкиН+6,ПозицияСсылкиК-(ПозицияСсылкиН+6));
		
		ПозицияНаименованиеН = СтрНайти(СтрокаДопМатериалов,">",,ПозицияСсылкиН+6);
		ПозицияНаименованиеК = СтрНайти(СтрокаДопМатериалов,"<",,ПозицияНаименованиеН+1);
		
		ТекстНаименования = СокрЛП(Сред(СтрокаДопМатериалов,ПозицияНаименованиеН+1,ПозицияНаименованиеК-(ПозицияНаименованиеН+1))); 
		
		ПозицияСледующейСсылки = СтрНайти(СтрокаДопМатериалов,"href=""",,,НомерВхождения+1);
		
		НачалоБлокаОписания = СтрНайти(СтрокаДопМатериалов,"""additionalFileDescription""",,ПозицияНаименованиеК);
		
		ЕстьОписание = Ложь; //описание может не быть не у каждой ссылки
		Если НачалоБлокаОписания>0
			И (ПозицияСледующейСсылки>НачалоБлокаОписания
				ИЛИ ПозицияСледующейСсылки = 0) Тогда
			ЕстьОписание = Истина;
		КонецЕсли;
		
		ОписаниеФайла = "";
		Если ЕстьОписание Тогда
			ОписаниеН = СтрНайти(СтрокаДопМатериалов,">",,НачалоБлокаОписания);
			ОписаниеК = СтрНайти(СтрокаДопМатериалов,"</",,ОписаниеН);
			ОписаниеФайла = СокрЛП(Сред(СтрокаДопМатериалов,ОписаниеН+1,ОписаниеК-(ОписаниеН+1)));
			ОписаниеФайла = СтрЗаменить(ОписаниеФайла,"<br/>",Символы.ПС);
		КонецЕсли;
		
		ЭтоКомплект = Ложь;
		Если СтрНайти(НРег(ОписаниеФайла),".repx")>0 Тогда
			ЭтоКомплект = Истина;	
		КонецЕсли;
		
		Если ЭтоКомплект = Истина Тогда
		
			НоваяСтрокаТаблицы = ТаблицаФайлов.Добавить();
			НоваяСтрокаТаблицы.Адрес = "https://releases.1c.ru"+ТекстСсылки;
			НоваяСтрокаТаблицы.Наименование = ТекстНаименования;
			НоваяСтрокаТаблицы.Описание = ОписаниеФайла;
			НоваяСтрокаТаблицы.ИндексКартинки = 3;
			
			МассивЧастейПути = СтрРазделить(СтрЗаменить(ТекстСсылки,"%5c","/"),"/",Ложь);
			ИмяФайлаСРасширением = МассивЧастейПути[МассивЧастейПути.Количество()-1];
			
			ПозицияРасширения = СтрНайти(ИмяФайлаСРасширением,".",НаправлениеПоиска.СКонца);
			Расширение = "";
			Если ПозицияРасширения>0 Тогда
				Расширение = Сред(ИмяФайлаСРасширением,ПозицияРасширения+1);
				ИмяФайла = Лев(ИмяФайлаСРасширением,ПозицияРасширения-1);
			Иначе
				ИмяФайла = ИмяФайлаСРасширением;
			КонецЕсли;	
			
			НоваяСтрокаТаблицы.ИмяФайла = ИмяФайла;
			НоваяСтрокаТаблицы.Расширение = НРег(Расширение);
			
			//Наименование комплекта формируется как <название комплекта> <версия (опционально)> <номер версии> <от> <дата>
			//заполним колонки версия и версия с датой, и оставим только название комплекта
			МассивЧастейНазвания = СтрРазделить(НоваяСтрокаТаблицы.Наименование," ",Ложь);
			
			КоличествоЧастейНазвания = МассивЧастейНазвания.Количество();
			Если КоличествоЧастейНазвания>3 Тогда
				НоваяСтрокаТаблицы.ВерсияНаСайте = МассивЧастейНазвания[КоличествоЧастейНазвания-3];
				НоваяСтрокаТаблицы.ВерсияНаСайтеСДатой = МассивЧастейНазвания[КоличествоЧастейНазвания-3] + " "
												+ МассивЧастейНазвания[КоличествоЧастейНазвания-2] + " "
												+ МассивЧастейНазвания[КоличествоЧастейНазвания-1];
												
				МассивЧастейНазвания.Удалить(КоличествоЧастейНазвания-1);
				МассивЧастейНазвания.Удалить(КоличествоЧастейНазвания-2);
				МассивЧастейНазвания.Удалить(КоличествоЧастейНазвания-3);
				Если НРег(МассивЧастейНазвания[КоличествоЧастейНазвания-4]) = "версия" Тогда
					МассивЧастейНазвания.Удалить(КоличествоЧастейНазвания-4);	
				КонецЕсли;
				
				НоваяСтрокаТаблицы.Наименование = СтрСоединить(МассивЧастейНазвания," ");
				
				Если СтрЗаканчиваетсяНа(НоваяСтрокаТаблицы.Наименование,",") Тогда
					//если последний символ в наименовании запятая, уберем ее
					НоваяСтрокаТаблицы.Наименование = Сред(НоваяСтрокаТаблицы.Наименование,1,СтрДлина(НоваяСтрокаТаблицы.Наименование)-1);	
				КонецЕсли;
			КонецЕсли;
			
			ТекДанныеКомплекта = ПолучитьДанныеУстановленногоКомплекта(ИмяФайла,СоответствиеИменИдентификаторам);
			НоваяСтрокаТаблицы.ТекущаяВерсия = ТекДанныеКомплекта.ТекущаяВерсия;
			НоваяСтрокаТаблицы.НеИспользуется = ТекДанныеКомплекта.НеИспользуется;
			НоваяСтрокаТаблицы.ИдентификаторКомплекта = ТекДанныеКомплекта.ИдентификаторКомплекта;
			
			ОбновитьПредставлениеВерсииВСтроке(НоваяСтрокаТаблицы);

			
			Если ЗначениеЗаполнено(НоваяСтрокаТаблицы.ТекущаяВерсия) Тогда
				РезультатСравнения = СравнитьВерсииКомплектов(НоваяСтрокаТаблицы.ВерсияНаСайте, НоваяСтрокаТаблицы.ТекущаяВерсия);
				
				Если РезультатСравнения.Разряд = -1 Тогда
					//Сравнить не удалось
					
				ИначеЕсли РезультатСравнения.Результат <> 0 И РезультатСравнения.Разряд = 0 Тогда
					//отличаются редакции - совсем новый комплект
					Если РезультатСравнения.Результат>0 Тогда
						НоваяСтрокаТаблицы.ЕстьОбновление = Истина;
						НоваяСтрокаТаблицы.Загрузить = Истина И НоваяСтрокаТаблицы.НеИспользуется = Ложь;
						НоваяСтрокаТаблицы.Информация = "Доступна новая версия";
					КонецЕсли;
				Иначе
					//обновление комплекта
					Если РезультатСравнения.Результат>0 Тогда
						НоваяСтрокаТаблицы.ЕстьОбновление = Истина;
						НоваяСтрокаТаблицы.Загрузить = Истина И НоваяСтрокаТаблицы.НеИспользуется = Ложь;
						НоваяСтрокаТаблицы.Информация = "Доступна новая версия";
					ИначеЕсли РезультатСравнения.Результат<0 Тогда
						//например, через ЛК получен комплект, который еще не опубликован на странице поддержки
						НоваяСтрокаТаблицы.Информация = "В базу загружена более новая версия, еще не опубликованная на сайте";
						НоваяСтрокаТаблицы.ЗагруженаБолееНоваяВерсия = Истина;
					ИначеЕсли РезультатСравнения.Результат=0 Тогда
						НоваяСтрокаТаблицы.Информация = "Версия уже загружена";
					КонецЕсли;
					
				КонецЕсли;
		
			КонецЕсли;
		КонецЕсли;	
			
		НомерВхождения = НомерВхождения + 1;
		
	КонецЦикла;
	
	ТаблицаФайлов.Сортировать("Наименование");
	
КонецПроцедуры

Функция ПолучитьКомплектДляЗагрузки(СсылкаДляСкачивания,КукиДляНужнойСтраницы,ДанныеАутентификации,Отказ,ПроблемыССетью) Экспорт
	
	Заголовки = Новый Соответствие;	
	Заголовки.Вставить("Cookie", КукиДляНужнойСтраницы);
			
	ПараметрыЗапроса = Новый Структура("ФорматОтвета,Заголовки",4,Заголовки); 
	ПараметрыЗапроса.Вставить("Заголовки",Заголовки);
	Результат = ЗагрузитьСодержимоеИзИнтернет(СсылкаДляСкачивания,,,ПараметрыЗапроса);
	
	Если Результат.КодОшибки = "ConnectError" Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(Нстр("ru='Не удалось выполнить подключение к серверу для загрузки комплекта.'"));
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(Результат.СообщениеОбОшибке);
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru = 'Подробности см. в журнале регистрации.'"));
		ПроблемыССетью = Истина;
		Возврат Результат;
	КонецЕсли;
		
	Если Результат.КодСостояния = 302 Тогда
		//переадресация - может быть или на авторизацию, или на скачивание файла
		
		АдресПереадресации = ПолучитьLocationИзОтвета(Результат.Содержимое);
				
		Если ТребуетсяАвторизация(АдресПереадресации) Тогда
			КукиДляНужнойСтраницы = ПолучитьКукиИзОтвета(Результат.Содержимое);		
			
			Результат = ПройтиАвторизацию(АдресПереадресации,Отказ,КукиДляНужнойСтраницы,ДанныеАутентификации);
			
			Если Отказ = Истина Тогда
				КукиДляНужнойСтраницы = "";
			КонецЕсли;
			
		Иначе
			//переадресация на хранилище файла
			Результат = ЗагрузитьСодержимоеИзИнтернет(АдресПереадресации,,,ПараметрыЗапроса);
			
		КонецЕсли;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция ПолучитьДанныеУстановленногоКомплекта(ИмяФайла,СоответствиеИменИдентификаторам) Экспорт
	ТекИмяФайла = ВРег(ИмяФайла);
	
	ДанныеДляВозврата = Новый Структура("ТекущаяВерсия,НеИспользуется,ИдентификаторКомплекта","",Ложь,"");
	
	ИдентификаторКомплекта = СоответствиеИменИдентификаторам.Получить(ТекИмяФайла);
	
	Запрос = Новый Запрос;
	//если это типовой комплект, то он должен быть в СоответствиеИменИдентификаторам
	//если вдруг комплекта нет в СоответствиеИменИдентификаторам (появился новый комплект),
	//то в качестве временного решения, имя файла может быть указано в Описании, при выгрузке комплекта,
	//тогда такой комплект в базе сопоставится с комплектом на сайте
	
	Если ЗначениеЗаполнено(ИдентификаторКомплекта) Тогда
		Запрос.Текст = 
			"ВЫБРАТЬ ПЕРВЫЕ 1
			|	СокрЛП(УстановленныеКомплектыОтчетности.Версия) КАК ТекущаяВерсия,
			|	СокрЛП(УстановленныеКомплектыОтчетности.ИдентификаторКомплекта) КАК ИдентификаторКомплекта,
			|	УстановленныеКомплектыОтчетности.НеИспользуется КАК НеИспользуется
			|ИЗ
			|	РегистрСведений.УстановленныеКомплектыОтчетности КАК УстановленныеКомплектыОтчетности
			|ГДЕ
			|	УстановленныеКомплектыОтчетности.ИдентификаторКомплекта = &ИдентификаторКомплекта";

		Запрос.УстановитьПараметр("ИдентификаторКомплекта", ИдентификаторКомплекта);
	
	Иначе
		Запрос.Текст = 
			"ВЫБРАТЬ ПЕРВЫЕ 1
			|	СокрЛП(УстановленныеКомплектыОтчетности.Версия) КАК ТекущаяВерсия,
			|	СокрЛП(УстановленныеКомплектыОтчетности.ИдентификаторКомплекта) КАК ИдентификаторКомплекта,
			|	УстановленныеКомплектыОтчетности.НеИспользуется КАК НеИспользуется
			|ИЗ
			|	РегистрСведений.УстановленныеКомплектыОтчетности КАК УстановленныеКомплектыОтчетности
			|ГДЕ
			|	УстановленныеКомплектыОтчетности.Описание ПОДОБНО &ИмяФайла";

		Запрос.УстановитьПараметр("ИмяФайла", "%"+ТекИмяФайла+"%");
	КонецЕсли;
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Если ВыборкаДетальныеЗаписи.Следующий() Тогда
		ЗаполнитьЗначенияСвойств(ДанныеДляВозврата,ВыборкаДетальныеЗаписи);
	КонецЕсли;
	
	Возврат ДанныеДляВозврата;
КонецФункции

Процедура ОбновитьПредставлениеВерсииВСтроке(СтрокаТаблицы)
	
	СтрокаТаблицы.ВерсияПредставление = "Доступна: "+ СтрокаТаблицы.ВерсияНаСайтеСДатой +", текущая: "+?(ЗначениеЗаполнено(СтрокаТаблицы.ТекущаяВерсия),СтрокаТаблицы.ТекущаяВерсия,"нет");

КонецПроцедуры

Функция СравнитьВерсииКомплектов(Знач СтрокаВерсии1, Знач СтрокаВерсии2) Экспорт
	
	Строка1 = ?(ПустаяСтрока(СтрокаВерсии1), "0.0.0.0", СтрокаВерсии1);
	Строка2 = ?(ПустаяСтрока(СтрокаВерсии2), "0.0.0.0", СтрокаВерсии2);
	
	Версия1 = СтроковыеФункцииКлиентСервер.РазложитьСтрокуВМассивПодстрок(Строка1, ".",,Истина);
	Версия2 = СтроковыеФункцииКлиентСервер.РазложитьСтрокуВМассивПодстрок(Строка2, ".",,Истина);
	
	Если Версия1.Количество() >= 4 И Версия2.Количество() >= 4 Тогда
		
		Результат = 0;
		Для Разряд = 0 По 3 Цикл
			Если Версия1[Разряд] = Версия2[Разряд] Тогда
				Продолжить;
			КонецЕсли;
			
			Если СтроковыеФункцииКлиентСервер.ТолькоЦифрыВСтроке(Версия1[Разряд])
				И СтроковыеФункцииКлиентСервер.ТолькоЦифрыВСтроке(Версия2[Разряд]) Тогда
			
				Результат = Число(Версия1[Разряд]) - Число(Версия2[Разряд]);
				Если Результат <> 0 Тогда
					Возврат Новый Структура("Разряд,Результат",Разряд,Результат);
				КонецЕсли;
			Иначе
				//если в разрядах буквы, и они отличаются
				Возврат Новый Структура("Разряд,Результат",-1,0);
			КонецЕсли;
		КонецЦикла;
		
		Возврат Новый Структура("Разряд,Результат",0,0);
		
	КонецЕсли;
	
	Возврат Новый Структура("Разряд,Результат",-1,0);	
				
	
КонецФункции


Функция ТребуетсяАвторизация(Адрес)
	
	Если СтрНайти(НРег(Адрес),"login")>0 Тогда		
		Возврат Истина;
	Иначе
		Возврат Ложь;
	КонецЕсли;
		
КонецФункции

Функция ПройтиАвторизацию(АдресАвторизации,Отказ,КукиДляНужнойСтраницы,ДанныеАутентификации)
		
	ПараметрыЗапроса = Новый Структура("ФорматОтвета,Метод",4,"GET");
					
	Результат = ЗагрузитьСодержимоеИзИнтернет(АдресАвторизации,,,ПараметрыЗапроса);
	Ответ = Результат.Содержимое;
	
	Заголовки = Новый Соответствие;
	
	КукиДляАвторизации = ПолучитьКукиИзОтвета(Результат.Содержимое);;
	
	Заголовки.Вставить("User-Agent", "complect-report-updater");
	Заголовки.Вставить("Content-Type", "application/x-www-form-urlencoded");
	Заголовки.Вставить("Cookie", КукиДляАвторизации);
	Заголовки.Вставить("Expect", "100-continue");
	
	Execution = "";
	ТелоСтрокой = Ответ.ПолучитьТелоКакСтроку();
	ПозицияExecution = СтрНайти(ТелоСтрокой,"name=""execution""");
	Если ПозицияExecution>0 Тогда
		ПозицияValueНачало = СтрНайти(ТелоСтрокой,"value=""",,ПозицияExecution);
		Если ПозицияValueНачало>0 Тогда
			ПозицияValueКонец = СтрНайти(ТелоСтрокой,"""",,ПозицияValueНачало+10);
			Execution = Сред(ТелоСтрокой,ПозицияValueНачало+7,ПозицияValueКонец-(ПозицияValueНачало+7)); 
		КонецЕсли;
	КонецЕсли;
	
	Тело="inviteCode=&username="+ДанныеАутентификации.Логин+"&password="+ДанныеАутентификации.Пароль+"
	|&execution="+Execution+"
	|&_eventId=submit&geolocation=&submit=Войти&rememberMe=on";
	
	Тело = СтрЗаменить(Тело,Символы.ПС,"");

	ПараметрыЗапроса = Новый Структура("ФорматОтвета,Заголовки,Метод,ДанныеДляОбработки,ФорматДанныхДляОбработки",4,Заголовки,"POST",Тело,1);
	
	АдресЛогина = "https://login.1c.ru/login"; //адрес по умолчанию
	Если СтрНайти(АдресАвторизации,"?")>0 Тогда
		АдресЛогина = Лев(АдресАвторизации,СтрНайти(АдресАвторизации,"?")-1);
	КонецЕсли;	
	
	Результат = ЗагрузитьСодержимоеИзИнтернет(АдресЛогина,,,ПараметрыЗапроса);
	Ответ = Результат.Содержимое;
	
	АдресПодтверждения = "";
	Если Ответ.КодСостояния = 302 Тогда
		
		АдресПодтверждения = ПолучитьLocationИзОтвета(Ответ);
		
		Если СтрНайти(АдресПодтверждения, "security_check")>0 Тогда
			//все в порядке, авторизация прошла
		
		ИначеЕсли ТребуетсяАвторизация(АдресПодтверждения) Тогда
			//значит не прошли авторизацию
			Отказ = Истина;
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru='Не удалось выполнить авторизацию на портале, проверьте правильность логина и пароля'"));
			
			Возврат Результат;
			
		Иначе
			//переадресация на не рассчитываемый адрес
			Отказ = Истина;
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru='При авторизации возникли проблемы"));
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(Результат.СообщениеОбОшибке);
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(Результат.ИнформацияОбОшибке);
			Возврат Результат;
			
		КонецЕсли;
	Иначе
		
		Отказ = Истина;
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru='Не удалось выполнить авторизацию на портале, проверьте правильность логина и пароля'"));
		Возврат Результат;
		
	КонецЕсли;
	
	Заголовки = Новый Соответствие;	
	Заголовки.Вставить("Cookie", КукиДляНужнойСтраницы);
	
	ПараметрыЗапроса = Новый Структура("ФорматОтвета,Заголовки",4,Заголовки);
	ПараметрыЗапроса.Вставить("Заголовки",Заголовки);
	
	//после подтверждения в ответе, в Location возвращается ссылка на страницу, которая была нужна изначально,
	//поэтому сразу выполняем переадресацию
	Результат = ЗагрузитьСодержимоеИзИнтернет(АдресПодтверждения,,,ПараметрыЗапроса, Истина);
	
	Возврат Результат;
	
КонецФункции

Функция ПолучитьLocationИзОтвета(Ответ)
	//в ответе заголовок с переадресацией может быть как Location, так и location
	Location = Неопределено;
	
	Location = Ответ.Заголовки.Получить("Location");
				
	Если Location = Неопределено Тогда
		Location = Ответ.Заголовки.Получить("location");	
	КонецЕсли;
	
	Возврат Location;
	
КонецФункции

Функция ПолучитьКукиИзОтвета(Ответ)
	//в ответе заголовок с куки может быть как Set-Cookie, так и set-cookie
	КукиИзОтвета = Неопределено;
	
	КукиИзОтвета = Ответ.Заголовки.Получить("Set-Cookie");
				
	Если КукиИзОтвета = Неопределено Тогда
		КукиИзОтвета = Ответ.Заголовки.Получить("set-cookie");	
	КонецЕсли;
	
	Возврат КукиИзОтвета;
	
КонецФункции

Функция ЗагрузитьСодержимоеИзИнтернет(
		Знач URL,
		Знач Логин = Неопределено,
		Знач Пароль = Неопределено,
		ПараметрыЗапроса = Неопределено,
		ВыполнятьПереадресацию = Ложь) Экспорт
	
	Результат = Новый Структура;
	Результат.Вставить("КодОшибки"         , "");
	Результат.Вставить("СообщениеОбОшибке" , "");
	Результат.Вставить("ИнформацияОбОшибке", "");
	Результат.Вставить("Содержимое"        , Неопределено);
	Результат.Вставить("КодСостояния"      , 0);
	Результат.Вставить("ФорматОтвета"      , 0);
	
	ПараметрыПолучения = Новый Структура;
	ПараметрыПолучения.Вставить("ФорматОтвета"            , 0);
	ПараметрыПолучения.Вставить("Метод"                   , "GET");
	ПараметрыПолучения.Вставить("ДанныеДляОбработки"      , Неопределено);
	ПараметрыПолучения.Вставить("ФорматДанныхДляОбработки", 0);
	ПараметрыПолучения.Вставить("Заголовки"               , Неопределено);
	ПараметрыПолучения.Вставить("ИмяФайлаОтвета"          , Неопределено);
	ПараметрыПолучения.Вставить("Таймаут"                 , -1);
	ПараметрыПолучения.Вставить("НастройкиПрокси"         , Неопределено);
	
	Если ПараметрыЗапроса <> Неопределено Тогда
		ЗаполнитьЗначенияСвойств(ПараметрыПолучения, ПараметрыЗапроса);
	КонецЕсли;
	 
	Если ПараметрыПолучения.Таймаут = -1 Тогда
		// Таймаут по умолчанию.
		ПараметрыПолучения.Таймаут = 30;
	КонецЕсли;
	
	Результат.ФорматОтвета = ПараметрыПолучения.ФорматОтвета;
	
	КоличествоПеренаправлений  = 0;
	МаксКолвоПеренаправлений   = 7;
	Перенаправления            = Новый Массив;
	ВыполненныеПеренаправления = Новый Соответствие;
	ПроксиПоСхемам             = Новый Соответствие;
	ЗащищенноеСоединениеКэш    = Неопределено;
	
	URLДляПолучения = URL;
	HTTPЗапрос = Новый HTTPЗапрос;
	Если ПараметрыПолучения.Заголовки <> Неопределено Тогда
		HTTPЗапрос.Заголовки = ПараметрыПолучения.Заголовки;
	КонецЕсли;
	ТелоУстановлено = Ложь;
	Ответ = Неопределено;
	Пока КоличествоПеренаправлений < МаксКолвоПеренаправлений Цикл

		СтруктураURI = ОбщегоНазначенияКлиентСервер.СтруктураURI(URLДляПолучения);
		Если СтруктураURI.Схема <> "https" Тогда
			ЗащищенноеСоединение = Неопределено;
		Иначе
			Если ЗащищенноеСоединениеКэш = Неопределено Тогда
				ЗащищенноеСоединениеКэш = ОбщегоНазначенияКлиентСервер.НовоеЗащищенноеСоединение(
					Неопределено,
					Новый СертификатыУдостоверяющихЦентровОС);
			КонецЕсли;
			ЗащищенноеСоединение = ЗащищенноеСоединениеКэш;
		КонецЕсли;

		Если НЕ ПустаяСтрока(СтруктураURI.Логин) Тогда
			ЛогинДляПолучения  = СтруктураURI.Логин;
			ПарольДляПолучения = СтруктураURI.Пароль;
		Иначе
			ЛогинДляПолучения  = Логин;
			ПарольДляПолучения = Пароль;
		КонецЕсли;

		Если СтруктураURI.Порт = Неопределено ИЛИ ПустаяСтрока(СтруктураURI.Порт) Тогда
			Порт = ?(ЗащищенноеСоединение = Неопределено, 80, 443);
		Иначе
			Порт = Число(СтруктураURI.Порт);
		КонецЕсли;

		Прокси = ПроксиПоСхемам.Получить(СтруктураURI.Схема);
		Если Прокси = Неопределено Тогда
			Если ПараметрыПолучения.НастройкиПрокси = Неопределено Тогда
				Прокси = ПолучениеФайловИзИнтернета.ПолучитьПрокси(СтруктураURI.Схема);
			Иначе
				Прокси = СформироватьИнтернетПрокси(ПараметрыПолучения.НастройкиПрокси, СтруктураURI.Схема);
			КонецЕсли;
			ПроксиПоСхемам.Вставить(СтруктураURI.Схема, Прокси);
		КонецЕсли;

		Соединение = Новый HTTPСоединение(
			СтруктураURI.Хост,
			Порт,
			ЛогинДляПолучения,
			ПарольДляПолучения,
			Прокси,
			ПараметрыПолучения.Таймаут,
			ЗащищенноеСоединение);

		Попытка

			HTTPЗапрос.АдресРесурса = СтруктураURI.ПутьНаСервере;

			Если ПараметрыПолучения.Метод = "GET" Тогда
				Ответ = Соединение.Получить(HTTPЗапрос, ПараметрыПолучения.ИмяФайлаОтвета);
			ИначеЕсли ПараметрыПолучения.Метод = "HEAD" Тогда
				Ответ = Соединение.ПолучитьЗаголовки(HTTPЗапрос);
			Иначе
			
				Если НЕ ТелоУстановлено Тогда

					Если ПараметрыПолучения.ДанныеДляОбработки <> Неопределено Тогда

						Если ПараметрыПолучения.ФорматДанныхДляОбработки = 0 Тогда

							HTTPЗапрос.УстановитьИмяФайлаТела(ПараметрыПолучения.ДанныеДляОбработки);

						ИначеЕсли ПараметрыПолучения.ФорматДанныхДляОбработки = 1 Тогда

							HTTPЗапрос.УстановитьТелоИзСтроки(ПараметрыПолучения.ДанныеДляОбработки);

						Иначе

							HTTPЗапрос.УстановитьТелоИзДвоичныхДанных(ПараметрыПолучения.ДанныеДляОбработки);

						КонецЕсли;

					КонецЕсли;

					ТелоУстановлено = Истина;

				КонецЕсли;

				Если ПараметрыПолучения.Метод = "PUT" Тогда
					Ответ = Соединение.Записать(HTTPЗапрос);
				Иначе
					// POST
					Ответ = Соединение.ОтправитьДляОбработки(HTTPЗапрос, ПараметрыПолучения.ИмяФайлаОтвета);
				КонецЕсли;

			КонецЕсли;

		Исключение
			
			ПредставлениеОшибки = ОбработкаОшибок.КраткоеПредставлениеОшибки(ИнформацияОбОшибке());
			ПодробноеОписаниеОшибки = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
				НСтр("ru = 'Не удалось загрузить содержимое (%1). %2'"),
				URL,
				ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
			
			// Диагностика соединения с ресурсом.
			Попытка
				
				РезультатДиагностики = ПолучениеФайловИзИнтернета.ДиагностикаСоединения(URL);
				ОписаниеРезультатаДиагностики = НСтр("ru = 'Результаты диагностики соединения:'")
					+ Символы.ПС + РезультатДиагностики.ОписаниеОшибки;
				
			Исключение
				
				ОписаниеРезультатаДиагностики = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
					НСтр("ru = 'Не удалось выполнить диагностику соединения. %1'"),
					ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
				
			КонецПопытки;
			
			УстановитьОписаниеОшибки(
				Результат,
				"ConnectError",
				ПредставлениеОшибки,
				ПодробноеОписаниеОшибки + Символы.ПС + ОписаниеРезультатаДиагностики,
				Перенаправления);
			Возврат Результат;
			
		КонецПопытки;

		Результат.КодСостояния = Ответ.КодСостояния;
		
		Если ВыполнятьПереадресацию = Ложь Тогда
			Прервать;
		КонецЕсли;
		
		Если Ответ.КодСостояния = 301 // 301 Moved Permanently
			ИЛИ Ответ.КодСостояния = 302 // 302 Found, 302 Moved Temporarily
			ИЛИ Ответ.КодСостояния = 303 // 303 See Other by GET
			ИЛИ Ответ.КодСостояния = 307 Тогда // 307 Temporary Redirect

			КоличествоПеренаправлений = КоличествоПеренаправлений + 1;

			Если КоличествоПеренаправлений > МаксКолвоПеренаправлений Тогда
				УстановитьОписаниеОшибки(
					Результат,
					"ServerError",
					НСтр("ru = 'Превышено количество перенаправлений.'"),
					СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
						НСтр("ru = 'Ошибка сервера при получении файла (%1). Превышено количество перенаправлений (%2).'"),
						URL,
						МаксКолвоПеренаправлений),
					Перенаправления);
				Возврат Результат;
			Иначе
				Location = ПолучитьLocationИзОтвета(Ответ);
				
				Если Location = Неопределено Тогда
					УстановитьОписаниеОшибки(
						Результат,
						"ServerError",
						НСтр("ru = 'Некорректное перенаправление.'"),
						СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
							НСтр("ru = 'Ошибка сервера (%1) при получении файла (%2). Некорректное перенаправление, отсутствует HTTP-заголовок ответа ""Location"".'"),
							Ответ.КодСостояния,
							URL),
						Перенаправления);
					Возврат Результат;
				Иначе
					Location = СокрЛП(Location);
					Если ПустаяСтрока(Location) Тогда
						УстановитьОписаниеОшибки(
							Результат,
							"ServerError",
							НСтр("ru = 'Некорректное перенаправление.'"),
							СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
								НСтр("ru = 'Ошибка сервера (%1) при получении файла (%2). Некорректное перенаправление, пустой HTTP-заголовок ответа ""Location"".'"),
								Ответ.КодСостояния,
								URL),
							Перенаправления);
						Возврат Результат;
					КонецЕсли;

					Если ВыполненныеПеренаправления.Получить(Location) <> Неопределено Тогда
						УстановитьОписаниеОшибки(
							Результат,
							"ServerError",
							НСтр("ru = 'Циклическое перенаправление.'"),
							СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
								НСтр("ru = 'Ошибка сервера (%1) при получении файла (%2). Циклическое перенаправление (%3).'"),
								Ответ.КодСостояния,
								URL,
								Location),
							Перенаправления);
						Возврат Результат;
					КонецЕсли;

					ВыполненныеПеренаправления.Вставить(Location, Истина);
					URLДляПолучения = Location;

					Перенаправления.Добавить(Строка(Ответ.КодСостояния) + ": " + Location);

				КонецЕсли;
				
			КонецЕсли;

		Иначе

			Прервать;

		КонецЕсли;

	КонецЦикла;

	Если ПараметрыПолучения.ФорматОтвета = 0 Тогда
		Результат.Содержимое = Ответ.ПолучитьИмяФайлаТела();
	ИначеЕсли ПараметрыПолучения.ФорматОтвета = 1 Тогда
		Результат.Содержимое = Ответ.ПолучитьТелоКакСтроку();
	ИначеЕсли ПараметрыПолучения.ФорматОтвета = 2 Тогда
		Результат.Содержимое = Ответ.ПолучитьТелоКакДвоичныеДанные();
	Иначе
		Результат.Содержимое = Ответ;
	КонецЕсли;
	
	// Обработка ответа
	Если Ответ.КодСостояния < 200 Или Ответ.КодСостояния >= 300 Тогда

		// Анализ ошибки
		Если Ответ.КодСостояния = 407 Тогда

			// Ошибка подключения - не пройдена аутентификация на прокси-сервере.
			УстановитьОписаниеОшибки(
				Результат,
				"ConnectError",
				НСтр("ru = 'Ошибка аутентификации на прокси-сервере.'"),
				СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
					НСтр("ru = 'Ошибка клиента (%1) при выполнении запроса к ресурсу (%2).
						|Тело ответа: %3'"),
					Ответ.КодСостояния,
					URL,
					Лев(Ответ.ПолучитьТелоКакСтроку(), 5120)),
				Перенаправления);

		ИначеЕсли Ответ.КодСостояния < 200
			ИЛИ Ответ.КодСостояния >= 300
			И Ответ.КодСостояния < 400 Тогда

			// Формат ответа сервера не поддерживается.
			УстановитьОписаниеОшибки(
				Результат,
				"ServerError",
				СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
					НСтр("ru = 'Некорректный ответ сервера (%1).'"),
					Ответ.КодСостояния),
				СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
					НСтр("ru = 'Ошибка сервера при получении файла (%1). Некорректный (неподдерживаемый) ответ (%2).
						|Тело ответа: %3'"),
					URL,
					Ответ.КодСостояния,
					Лев(Ответ.ПолучитьТелоКакСтроку(), 5120)),
				Перенаправления);

		ИначеЕсли Ответ.КодСостояния >= 400 И Ответ.КодСостояния < 500 Тогда

			// Ошибка клиентской части - некорректный запрос.
			УстановитьОписаниеОшибки(
				Результат,
				"ClientError",
				СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
					НСтр("ru = 'Ошибка (%1) при выполнении запроса к ресурсу.'"),
					Строка(Ответ.КодСостояния)),
				СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
					НСтр("ru = 'Ошибка клиента (%1) при выполнении запроса к ресурсу (%2).
						|Тело ответа: %3'"),
					Ответ.КодСостояния,
					URL,
					Лев(Ответ.ПолучитьТелоКакСтроку(), 5120)),
				Перенаправления);

		Иначе

			// Ошибка сервера - 5хх
			УстановитьОписаниеОшибки(
				Результат,
				"ServerError",
				СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
					НСтр("ru = 'Код ошибки: %1.'"),
					Строка(Ответ.КодСостояния)),
				СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
					НСтр("ru = 'Ошибка сервера (%1) при обработке запроса к ресурсу (%2).
						|Тело ответа: %3'"),
					Ответ.КодСостояния,
					URL,
					Лев(Ответ.ПолучитьТелоКакСтроку(), 5120)),
				Перенаправления);

		КонецЕсли;

		ДобавитьСписокПеренаправленийКИнформацииОбОшибке(
			Результат.ИнформацияОбОшибке,
			Перенаправления);

	КонецЕсли;

	Возврат Результат;

КонецФункции

Функция СформироватьИнтернетПрокси(
		НастройкаПроксиСервера,
		Протокол)
	
	Если НастройкаПроксиСервера = Неопределено
		Или НастройкаПроксиСервера = "<СистемныеУстановки>" Тогда
		// Системные установки прокси-сервера.
		Возврат Неопределено;
	КонецЕсли;	
	
	ИспользоватьПрокси = НастройкаПроксиСервера.Получить("ИспользоватьПрокси");
	Если Не ИспользоватьПрокси Тогда
		// Не использовать прокси-сервер.
		Возврат Новый ИнтернетПрокси(Ложь);
	КонецЕсли;
	
	ИспользоватьСистемныеНастройки = НастройкаПроксиСервера.Получить("ИспользоватьСистемныеНастройки");
	Если ИспользоватьСистемныеНастройки Тогда
		// Системные настройки прокси-сервера.
		Возврат Новый ИнтернетПрокси(Истина);
	КонецЕсли;
			
	// Настройки прокси-сервера, заданные вручную.
	Прокси = Новый ИнтернетПрокси;
	
	// Определение адреса и порта прокси-сервера.
	ДополнительныеНастройки = НастройкаПроксиСервера.Получить("ДополнительныеНастройкиПрокси");
	ПроксиПоПротоколу = Неопределено;
	Если ТипЗнч(ДополнительныеНастройки) = Тип("Соответствие") Тогда
		ПроксиПоПротоколу = ДополнительныеНастройки.Получить(Протокол);
	КонецЕсли;
	
	ИспользоватьАутентификациюОС = НастройкаПроксиСервера.Получить("ИспользоватьАутентификациюОС");
	ИспользоватьАутентификациюОС = ?(ИспользоватьАутентификациюОС = Истина, Истина, Ложь);
	
	Если ТипЗнч(ПроксиПоПротоколу) = Тип("Структура") Тогда
		Прокси.Установить(Протокол, ПроксиПоПротоколу.Адрес, ПроксиПоПротоколу.Порт,
			НастройкаПроксиСервера["Пользователь"], НастройкаПроксиСервера["Пароль"], ИспользоватьАутентификациюОС);
	Иначе
		Прокси.Установить(Протокол, НастройкаПроксиСервера["Сервер"], НастройкаПроксиСервера["Порт"], 
			НастройкаПроксиСервера["Пользователь"], НастройкаПроксиСервера["Пароль"], ИспользоватьАутентификациюОС);
	КонецЕсли;
	
	Прокси.НеИспользоватьПроксиДляЛокальныхАдресов = НастройкаПроксиСервера["НеИспользоватьПроксиДляЛокальныхАдресов"];
	
	АдресаИсключений = НастройкаПроксиСервера.Получить("НеИспользоватьПроксиДляАдресов");
	Если ТипЗнч(АдресаИсключений) = Тип("Массив") Тогда
		Для каждого АдресИсключения Из АдресаИсключений Цикл
			Прокси.НеИспользоватьПроксиДляАдресов.Добавить(АдресИсключения);
		КонецЦикла;
	КонецЕсли;
	
	Возврат Прокси;
	
КонецФункции

Процедура УстановитьОписаниеОшибки(
		Результат,
		КодОшибки,
		СообщениеОбОшибке,
		ИнформацияОбОшибке,
		Перенаправления)
	
	Результат.КодОшибки          = КодОшибки;
	Результат.СообщениеОбОшибке  = СообщениеОбОшибке;
	Сообщение = "";
	Если КодОшибки = "ConnectError" Тогда
		Сообщение = НСтр("ru = 'Ошибка при подключении к серверу.'");
	ИначеЕсли КодОшибки = "ServerError" Тогда
		Сообщение = НСтр("ru = 'На сервере возникла внутренняя ошибка при обработке запроса.'");
	ИначеЕсли КодОшибки = "ClientError" Тогда
		Сообщение = НСтр("ru = 'Некорректный запрос.'");
	ИначеЕсли КодОшибки = "InternalError" Тогда
		Сообщение = НСтр("ru = 'Внутренняя ошибка.'");
	ИначеЕсли КодОшибки = "LoginError" Тогда
		Сообщение = НСтр("ru = 'Ошибка аутентификации на сервере.'");
	КонецЕсли;
	
	Результат.СообщениеОбОшибке =
		?(ПустаяСтрока(Сообщение), "", Сообщение + " ")
		+ СообщениеОбОшибке;
	
	Результат.ИнформацияОбОшибке = ИнформацияОбОшибке;
	
	Если Перенаправления.Количество() > 0 Тогда
		Результат.ИнформацияОбОшибке = Результат.ИнформацияОбОшибке + Символы.ПС
			+ НСтр("ru = 'Перенаправления:'") + Символы.ПС
			+ СтрСоединить(Перенаправления, ", " + Символы.ПС);
	КонецЕсли;
	
КонецПроцедуры

// Устанавливает описание перенаправления при выполнения операции.
//
// Параметры:
//  ИнформацияОбОшибке - Строка - описание ошибки для администратора;
//  Перенаправления - Массив - данные перенаправлений.
//
Процедура ДобавитьСписокПеренаправленийКИнформацииОбОшибке(
		ИнформацияОбОшибке,
		Перенаправления)
	
	Если Перенаправления.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	ИнформацияОбОшибке = ИнформацияОбОшибке + Символы.ПС
		+ НСтр("ru = 'Перенаправления:'") + Символы.ПС
		+ СтрСоединить(Перенаправления, ", " + Символы.ПС);
	
КонецПроцедуры





#КонецЕсли
